dev-scripts/verify_kv_queue_size/throttle_on_data/rbd_plot_qd_2019-10-29/fio_exp_qd4_2019-10-29/dump-fio-bench-4-1
fio-write: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=rbd, iodepth=4
fio-3.16-28-gc656
Starting 1 process

fio-write: (groupid=0, jobs=1): err= 0: pid=2217: Tue Oct 29 08:40:53 2019
  write: IOPS=30, BW=3952KiB/s (4047kB/s)(465MiB/120553msec); 0 zone resets
    slat (usec): min=44, max=341, avg=97.99, stdev=23.03
    clat (msec): min=16, max=4338, avg=129.26, stdev=231.00
     lat (msec): min=16, max=4338, avg=129.36, stdev=231.00
    clat percentiles (msec):
     |  1.00th=[   26],  5.00th=[   34], 10.00th=[   42], 20.00th=[   52],
     | 30.00th=[   65], 40.00th=[   80], 50.00th=[   95], 60.00th=[  109],
     | 70.00th=[  125], 80.00th=[  150], 90.00th=[  230], 95.00th=[  305],
     | 99.00th=[  518], 99.50th=[ 1045], 99.90th=[ 3876], 99.95th=[ 4245],
     | 99.99th=[ 4329]
   bw (  KiB/s): min=  256, max= 7168, per=100.00%, avg=4050.61, stdev=1639.68, samples=235
   iops        : min=    1, max=    1, avg= 1.00, stdev= 0.00, samples=3722
  lat (msec)   : 20=0.30%, 50=17.36%, 100=35.73%, 250=38.15%, 500=7.39%
  lat (msec)   : 750=0.40%, 1000=0.13%, 2000=0.16%, >=2000=0.38%
  cpu          : usr=0.36%, sys=0.07%, ctx=3935, majf=0, minf=1328
  IO depths    : 1=0.1%, 2=0.2%, 4=99.8%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3722,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=3952KiB/s (4047kB/s), 3952KiB/s-3952KiB/s (4047kB/s-4047kB/s), io=465MiB (488MB), run=120553-120553msec

Disk stats (read/write):
  sdc: ios=141/14260, merge=0/85886, ticks=1324/587820, in_queue=589208, util=94.57%